if __name__ == "__main__":
    # 切片:通过切片方法可以按照一定规则截取容器的一部分数据

    # str切片
    str1 = 'abcde'
    # 格式:[起始位置:终止位置:步长]
    # 不会修改原有字符串,而是产生了一个新的字符串
    print(str1[2:])  # cde

    # list可以切片么?
    list1 = [1, 2, 3, 4]
    # list切片方式方法和str完全相同
    # list切片后不会在原有数据上进行修改,而是产生了一个新的列表
    print(list1[1:3:1])  # [2, 3]
    print(list1)

    # tuple 可以切片么?
    tuple1 = (1, 2, 3, 4)
    # tuple1切片方式方法和str完全相同
    # 切片后不会在原有数据上进行修改,而是产生了一个新的列表
    print(tuple1[1:3:1])  # (2, 3)
    print(tuple1)

    # dict可以切片么?  肯定不行,因为不能使用索引获取数据
    # set 可以切片么?  肯定不行,因为不能使用索引获取数据

    # 结论:
    # 1.list str tuple 可以使用切片,格式是:[起始位置:终止位置:步长],三者使用方式完全一致
    # 2.所有的切片都不会在原有的数据上进行修改,而是产生一个新的数据序列
    # 3.集合和字典无法切片,因为不能使用索引获取数据元素