def example1():
    # for循环的语法结构
    """
    for 临时变量 in 数据序列(容器):
        要重复执行的代码
    """
    # 循环逻辑:for循环会依次提取数据序列中的元素,每次提取一个,放入临时变量中储存,在循环体中可以使用临时变量,数据序列中有多少个元素,for循环的循环体将会被执行多少次

    str1 = 'helloPython'
    # 循环遍历str1  遍历:依次提取每一个元素
    for i in str1:
        print(i)

    # for循环和while循环的区别:
    # 1/for循环数据序列,元素提取完成自动停止,不需要使用循环变量
    # 2/for循环不需要循环条件,所以也不会有循环条件成立喝不成立的说法
    # 3/在开发中我们使用for循环的比例居多,while循环主要是构造死循环结构
    # 4/for循环需要配合容器类型(数据序列)进行使用


def example2():
    # 语法结构
    """
    for 临时变量  in 数据序列(容器):
        循环执行的代码
    else:
        所有元素遍历完成后执行的代码
    """

    # 需求: 下载一个视频  从0% - 100%,下载完成后,显示下载完成 否则不显示
    for i in range(0, 101):
        if i == 60:
            # print('别下了,网费用光了')
            # break  # 打破循环,造成循环异常结束,不会执行else 中的命令
            print('丢包,这里没有下载好继续下载别的吧')
            continue  # 结束本次循环,进入下一次循环,不会造成循环异常结束,会执行else中的命令
        print(f'下载进度:{i}%')
    else:
        print('下载完成')


if __name__ == "__main__":
    example1()
    example2()

