if __name__ == "__main__":
    # \n  换行符
    # 为什么两个print之间可以自动换行
    # 在print定义时自动在结尾加上了'\n'所以每次打印结束后,会自动换行
    print(123)
    print('hello world \n')
    print(456)
    # 如果不想让其自动换行, 在字符串输入结束后,使用end = '结束符' 可以修改print打印结束后插入的字符
    print(123, end='$$$')
    print(456)

    # \t 制表符
    print('3  4\t5')
    # %%  输出%
    # 在不适用字符串格式化拼接时,可以进行%的单独输出
    print('我的业绩增长了100%')

    score = 100
    # 在使用字符串格式化的时候,字符串中的%不能单独输出,必须配合占位符,或者使用%%进行输出
    print('我的成绩增加了%d%%' % score)

    # 转译字符:在字符串中,一般情况下n  或者 t这类字母没有特殊含义,如果想给他赋予特殊含义,则需要使用\进行转译