def example1():
    # 需求: 输出5遍道歉信息

    # 从第几次开始
    i = 0  # 在使用while循环的时候可以用i控制循环跳出条件(控制循环次数)----循环变量
    while i < 5:
        # 要重复执行的代码
        print('老婆大人我错了')
        print('你错哪了')
        print('我错在...')
        print('你根本不知道你错在哪')
        # 控制循环跳出条件
        i += 1

    '''
    while 条件:
        满足条件时执行的代码

    while 必备的三个元素都有什么????   
    while 关键字   
    循环条件   
    循环体
    '''

def example2():
    # 语法结构
    '''
    while 循环条件:
        条件满足,则循环执行此代码
    else:
        循环条件不成立执行此代码,执行后循环结构终止
    '''

    # 需求: 下载一个视频  从0% - 100%,下载完成后,显示下载完成 否则不显示
    # 循环条件成立,则反复执行循环体中的代码,如果循环条件不成立,则执行else中的代码
    # break打破了循环结构,循环异常终止,没有执行到循环条件不成立的那一刻,所以else不会被执行
    # continue没有打破循环结构,循环正常进入循环条件不成立的状态后才会终止,此时执行else中的命令

    i = 0
    while i <= 100:
        if i == 60:
            print('下载非法文件,已经将你举报,下载终止')
            # break  # 会造成循环异常终止,不会执行else中的代码
            i += 1
            continue  # 不会造成循环异常终止,会执行else中的代码
        print(f'下载进度:{i}%')
        i += 1
    else:
        print('下载完成')


if __name__ == "__main__":
    example1()
    example2()